Script started on Mon Nov  4 12:54:36 2013
[?1034hbash-1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005a4: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffe188) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) print argc
$1 = 3
(gdb) print argc v
$2 = (char **) 0x7fffffffe188
(gdb) print argv[]0]
$3 = 0x7fffffffe478 "/afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffe4b8 "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffe4bc "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffe4c0 "MANWIDTH=72"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffe4cc "HOSTNAME=unix1.lt.ucsc.edu"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffe4e7 "GNUPLOT_DEFAULT_GDFONT=LiberationSans-Regular"
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) quit  
A debugging session is active.

	Inferior 1 [process 2438] will be killed.

Quit anyway? (y or n) e y
bash-2$ exit
exit

Script done on Mon Nov  4 12:55:17 2013
