Script started on Mon Nov  4 12:49:45 2013
[?1034hbash-1$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function 'main':
list2.c:13: warning: unused parameter 'argc'
+ set +x
============================================================
bash-2$ valgrind list2 foo bar
==1981== Memcheck, a memory error detector
==1981== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==1981== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==1981== Command: list2 foo bar
==1981== 
0x4c27180->node {word=0x7ff000479->[MANWIDTH=72], link=0x4c27130}
0x4c27130->node {word=(nil)->[(null)], link=0x4c270e0}
0x4c270e0->node {word=0x7ff000475->[bar], link=0x4c27090}
0x4c27090->node {word=0x7ff000471->[foo], link=0x4c27040}
==1981== Conditional jump or move depends on uninitialised value(s)
==1981==    at 0x400663: main (list2.c:22)
==1981== 
==1981== Conditional jump or move depends on uninitialised value(s)
==1981==    at 0x3710E45948: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981== 
==1981== Use of uninitialised value of size 8
==1981==    at 0x3710E43D01: _itoa_word (in /lib64/libc-2.12.so)
==1981==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981== 
==1981== Conditional jump or move depends on uninitialised value(s)
==1981==    at 0x3710E43D08: _itoa_word (in /lib64/libc-2.12.so)
==1981==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981== 
==1981== Conditional jump or move depends on uninitialised value(s)
==1981==    at 0x3710E4697D: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981== 
==1981== Conditional jump or move depends on uninitialised value(s)
==1981==    at 0x3710E45385: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981== 
==1981== Conditional jump or move depends on uninitialised value(s)
==1981==    at 0x3710E453FD: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981== 
0x4c27040->node {word=0x7ff00046b->[list2], link=0x3710e0fb88}
==1981== Use of uninitialised value of size 8
==1981==    at 0x40065C: main (list2.c:22)
==1981== 
==1981== Use of uninitialised value of size 8
==1981==    at 0x40061E: main (list2.c:23)
==1981== 
==1981== Use of uninitialised value of size 8
==1981==    at 0x400626: main (list2.c:23)
==1981== 
==1981== Use of uninitialised value of size 8
==1981==    at 0x40062D: main (list2.c:23)
==1981== 
==1981== Invalid read of size 1
==1981==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
==1981==  Address 0xc0012000029d5 is not stack'd, malloc'd or (recently) free'd
==1981== 
==1981== 
==1981== Process terminating with default action of signal 11 (SIGSEGV)
==1981==  General Protection Fault
==1981==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==1981==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==1981==    by 0x40064B: main (list2.c:23)
0x3710e0fb88->node {word=0xc0012000029d5->[==1981== 
==1981== HEAP SUMMARY:
==1981==     in use at exit: 80 bytes in 5 blocks
==1981==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==1981== 
==1981== LEAK SUMMARY:
==1981==    definitely lost: 0 bytes in 0 blocks
==1981==    indirectly lost: 0 bytes in 0 blocks
==1981==      possibly lost: 0 bytes in 0 blocks
==1981==    still reachable: 80 bytes in 5 blocks
==1981==         suppressed: 0 bytes in 0 blocks
==1981== Rerun with --leak-check=full to see details of leaked memory
==1981== 
==1981== For counts of detected and suppressed errors, rerun with: -v
==1981== Use --track-origins=yes to see where uninitialised values come from
==1981== ERROR SUMMARY: 54 errors from 12 contexts (suppressed: 6 from 6)
Segmentation fault (core dumped)
bash-3$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/list2...done.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe4c0->[MANWIDTH=72], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe4bc->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe4b8->[foo], link=0x601010}
0x601010->node {word=0x7fffffffe478->[/afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/list2], link=0x3710e0fb88}

Program received signal SIGSEGV, Segmentation fault.
0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) where
#0  0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
#1  0x0000003710e4f44a in printf () from /lib64/libc.so.6
#2  0x000000000040064c in main (argc=3, argv=0x7fffffffe188) at list2.c:23
(gdb) list
6	
7	typedef struct node node;
8	struct node {
9	   char *word;
10	   node *link;
11	};
12	
13	int main (int argc, char **argv) {
14	   node *head;
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
No symbol "head" in current context.
(gdb) bt
#0  0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
#1  0x0000003710e4f44a in printf () from /lib64/libc.so.6
#2  0x000000000040064c in main (argc=3, argv=0x7fffffffe188) at list2.c:23
(gdb) up
#1  0x0000003710e4f44a in printf () from /lib64/libc.so.6
(gdb) up
#2  0x000000000040064c in main (argc=3, argv=0x7fffffffe188) at list2.c:23
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
(gdb) up
Initial frame selected; you cannot go up.
(gdb) print head
$1 = (node *) 0x601090
(gdb) print head[1@*
$2 = {word = 0x7fffffffe4c0 "MANWIDTH=72", link = 0x601070}
(gdb) print *head[1@(head->word)
$3 = 77 'M'
(gdb) print *(head->word)[1P[1Phead->word)     link->link_\  ->link
$4 = (node *) 0x601030
(gdb) print head->link->link->link) [1@*[1@(
$5 = {word = 0x7fffffffe4b8 "foo", link = 0x601010}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 2001] will be killed.

Quit anyway? (y or n) y
bash-4$ exit
exit

Script done on Mon Nov  4 12:51:30 2013
