Script started on Mon Nov  4 12:43:07 2013
[?1034hbash-1$ valgrind malloc
==1076== Memcheck, a memory error detector
==1076== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==1076== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==1076== Command: malloc
==1076== 
0x4c27090-> {6, (nil)}
==1076== 
==1076== HEAP SUMMARY:
==1076==     in use at exit: 16 bytes in 1 blocks
==1076==   total heap usage: 2 allocs, 1 frees, 32 bytes allocated
==1076== 
==1076== LEAK SUMMARY:
==1076==    definitely lost: 16 bytes in 1 blocks
==1076==    indirectly lost: 0 bytes in 0 blocks
==1076==      possibly lost: 0 bytes in 0 blocks
==1076==    still reachable: 0 bytes in 0 blocks
==1076==         suppressed: 0 bytes in 0 blocks
==1076== Rerun with --leak-check=full to see details of leaked memory
==1076== 
==1076== For counts of detected and suppressed errors, rerun with: -v
==1076== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 6 from 6)
bash-2$  gdb malloc
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/malloc...done.
(gdb) break main
Breakpoint 1 at 0x400594: file malloc.c, line 13.
(gdb) run  
Starting program: /afs/cats.ucsc.edu/users/s/pbgreerb/private/cmps012b/lab5/malloc 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=1, argv=0x7fffffffe198) at malloc.c:13
13	   node *ptr = malloc (sizeof (struct node));
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) print p ptr
$1 = (node *) 0x4004a0
(gdb) print ptr[Kprint ptr[1@*
$2 = {value = -1991643855, link = 0x495450f0e48348e2}
(gdb) bext    next
14	   ptr = malloc (sizeof (node));
(gdb) nextprint *ptr[1Pptr
$3 = (node *) 0x601010
(gdb) print ptr(gdb) [5Pnextprint *ptr
$4 = {value = 0, link = 0x0}
(gdb) print *ptr[1Pptr(gdb) [5Pnext
15	   ptr->value = 6;
(gdb) next
16	   ptr->link = NULL;
(gdb) next
17	   printf ("%p-> {%d, %p}\n", ptr, ptr->value, ptr->link);
(gdb) nextprint *ptr[1Pptr
$5 = (node *) 0x601030
(gdb) print ptr(gdb) [5Pnextprint *ptr[1Pptr[1@*ptr
$6 = {value = 6, link = 0x0}
(gdb) print *ptr[1Pptr(gdb) [5Pnext
0x601030-> {6, (nil)}
18	   free (ptr);
(gdb) next
19	   return EXIT_SUCCESS;
(gdb) next
20	}
(gdb) next
0x0000003710e1ecdd in __libc_start_main () from /lib64/libc.so.6
(gdb) quit
A debugging session is active.

	Inferior 1 [process 1080] will be killed.

Quit anyway? (y or n) y
bash-3$ exit
exit

Script done on Mon Nov  4 12:44:10 2013
